<?php

namespace App;

use Illuminate\Database\Eloquent\Model;

class Answer extends Model
{
	protected static $answers = [
	[ //1 'Кога изгаряш от нетърпение да си направиш селфи и да го споделиш в социалните мрежи?',
	'В банята, докато печеля Грами под душа;',
	// (Xcover 4, A3 2017, А5 2017, S7 Edge),
	'Обичам шопската салата и да се снимам с нея;',
 	//(J5 2016, J7 2016),
	'All селфитата са инклузив на хотела лятото в Гърция;',
	// (S7 Edge, A5 2016),
	'Вкъщи или в заведение, винаги по всяко време, да си се фотна – първа радост е за мене!;',
	// (S7 Edge, A3 2017, A5 2017)],
	],
	[
	//2 Коя е най-любимата ти лятна напитка
	'Розово шампанско;',
	//(S7 Edge, A3 2017, A5 2017)
	'Мастика с айрян;',
	// (Xcover 4, J5 2016)
	'„Секс на плажа“;',
	//(A3 2017, A5 2017)
	'Наливна бира;',
	//(Xcover 4, J7 2016)],
	],
	[
	//3 'Има ли размерът значение всъщност?',
	'Никакво, важни са техниката и технологиите;',
	// (A3 2017, J5 2016)
	'Размерът нека е удобен, важното е да издържа дълго, да е всъдеходен;',
	//(Xcover 4, A3 2017)
	'Има значение, когато е голям, иначе – не!;',
	// (S7 Edge, J7 2016, A5 2017)
	'Ако един не стига, взимам два!;',
	// (J5 2016)
	],
	[
	//4 Къде най-много обичаш да си почиваш?',
	'Вкъщи е разкошно, с видео и в чата денонощно;',
	// (J7 2016, J5 2016)
	'На високи сини планини, реки и златни равнини, небе по-нежно от коприна – да има фон за яка фото картина!;',
	//(A3 2017, A5 2017, S7 Edge)
	'На моренце, с коктейлче, дискотечка, приятели, кафенце...;',
	//(S7 Edge, A3 2017, A5 2017)
	'Далеч от хора и цивилизация, без посока, само с навигация!;',
	// (Xcover 4, J5 2016)],
	],
	[
	//5 'Как би се описал?'
	'Засукан флиртаджия;',
	// (A3 2017, A5 2017)
	'Леко сдухан, мистериозен мъдрец;',
	// (Xcover 4)
	'Ярък и шумен купонджия;',
	// (J5 2016, J7 2016)
	'Не бих се описвал, бих се рисувал!;',
	// (S7 Edge, A5 2017)],
	],
	[
	//6 'Какво искаш ти от връзката си с телефона?'
	'С часове да ме забавлява поне десетина, с кристален звук и ясна картина!;',
	// (J7 2016, J5 2016)
	'Да е до мен и в най-екстремните моменти, за безпроблемна работа , игри и подводно селфи!;',
	// (Xcover 4, A3 2017, A5 2017, S7 Edge)
	'Да показва на хората, че съм важен и красив, смартфонът в ръката ми е най-големия актив;',
	// (A5 2017, S7 Edge)
	'Да радва окото, да ми пее,  с  модерно алуминиево тяло да ме грее!;',
	// (A3 2017, A5 2017)],
	]
	];

	public static function get_answers($set)
	{
		return Answer::$answers[$set];
	}

}
