<?php

namespace App;

use Illuminate\Database\Eloquent\Model;

class Phone extends Model
{
	public static $phones = [
    //0
	['SGX4', 'Samsung Galaxy Xcover4',
	'Здрав, корав и всеобхватен, търпи геройски прах, вода и теб – дори и да си непохватен!',
	'G390 Galaxy Xcover4'],
	//1
	['SGJ5', 'Samsung Galaxy J5 Dual Sim',
	'Обичаш да се забавляваш с часове, купонджия и свежарка  – J5 най-добре ще набере всички твои 	хора с любими гласове!',
	'J510F Galaxy J5(2016)Duos'],
	//2
	['SJ7', 'Samsung J7',
	'Метален, тънък и голям , предлага мега забавление на широк екран! Вземи J7, за да ти е 	по-спокойно, че времето ти в дълги разговори ще е тройно!',
	'J710F Galaxy J7(2016)'],
	//3
	['SGA3', 'Samsung Galaxy A3(2017)',
	'Изискан си ценител на дизайна, обичаш да се перчиш, да се постваш и за никой не е тайна, че всеки ден и час готов си с А3 във ръката да цъфнеш в Instagram  със  супер яко селфи под водата!',
	'A320F Galaxy A392017'],
	//4
	['SGA5', 'Samsung Galaxy A5 (2017)',
	'Модерен, чувствен, инстинктивен – обичаш лукса и умираш да си атрактивен!Глези ти се с мощност, функции и корпус приковаващи внимание , казваме ти - А5 от Samsung  е твой, без капка колебание!',
	'Samsung Galaxy A5 (2017)'],
	//5
	['S7E', 'S7 Edge',
		'Официално, ти си фешън гуру на сезона! Честито, пада ти се S класата на телефона! В безкрайно съвършенство ще се потопиш, с ъс 7 Edge  е невъзможно да сгрешиш!',
		'Samsung Galaxy S7 Edge']
	];

}
